var questions = [
  {
    type: "choose",
    question: "<h3>Що таке Системний аналіз?</h3>",
    answers: [
      "Дисципліна, яка забезпечує утримання та накопичення інформації про предмет дослідження, як єдиного цілісного об’єкта.",
      "Послідовність дій між змінними та елементами системи",
      "Наука, що встановлює загальні закони ефективності систем як технічної, так і біологічної природи"
    ],
    correct: [1]
  },
  {
    type: "choose",
    question: "<h3>Що таке система?</h3>",
    answers: [
      "Комплекс системного забезпечення, що надає можливості створення, оновлення та пошуку інформації.",
      "Складна структура, яка взаємодіє з оточенням як єдине ціле",
      "Сукупність елементів й підсистем"
    ],
    correct: [2]
  },
  {
    type: "choose",
    question: "<h3>Що таке елемент системи?</h3>",
    answers: [
      "Найпростіша неподільна частина системи",
      "Об’єкт, який входить до деякої множини",
      "Пристрій, призначений для обробки інформації в цифровій формі"
    ],
    correct: [1]
  },
  {
    type: "choose",
    question: "<h3>Що таке рівновага системи?</h3>",
    answers: [
      "Ситуація, коли всі чинники врівноважують один одного так, що змінна величина не змінюється",
      "Стан, в якому внутрішні процеси не приводять до зміни параметрів",
      "Певний усталений стан"
    ],
    correct: [3]
  },
  {
    type: "choose",
    question: "<h3>Символічна форма системи?</h3>",
    answers: [
      "(x, G, S, ∆, λ)",
      "(M, N, R)",
      "(X, U, Z)"
    ],
    correct: [2]
  },
  {
    type: "choose",
    question: "<h3>Що таке ієрархія?</h3>",
    answers: [
      "Об’єкт, що складається із множини елементів.",
      "Система, яка складається з незалежних підмножин (груп), при цьому об’єкти однієї групи знаходяться під впливом іншої групи",
      "Множина елементів та їх зв’язків",
    ],
    correct: [2]
  },
  {
    type: "choose",
    question: "<h3>Що таке синергія?</h3>",
    answers: [
      "Цілеспрямованість дій компонентів посилює ефективність функціонування системи",
      "Цілі компонентів системи не збігаються з функціями системи",
      "Здатність системи зберігати працездатність при відмові її окремих елементів"
    ],
    correct: [1]
  }
];

$("document").ready(function () {
  $("#jQuizler").jQuizler(questions);
});